app/Controllers/EventsController.php

SELECT *
FROM `events`
---
    public function index()
    {
        $eventsModel = new EventsModel();
        $data['items']= $eventsModel->findAll();