app/Controllers/GalleryController.php

SELECT *
FROM `gallery`
---
    public function index()
    {
        $gallerymodel = new GalleryModel();
        $data['items'] = $gallerymodel->findAll();