app/Controllers/SignupController.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('mamun', 'mamun@gmail.com', '$2y$10$DDcw2nnODCz/oLCOBcuTguUDsFA.Q3jcwSy3XMftthlTYwjFz2ahu')
---
    public function store(){
        $rules=[
            'name'=>'required|min_length[2]|max_length[50]',
            'email'=>'required|min_length[4]|max_length[100]|valid_email|is_unique[users.email]',
            'password'=>'required|min_length[4]|max_length[50]',
            'confirmpassword'=>'matches[password]'

        ];
        if($this->validate($rules)){
            $data=[
                'name'=>$this->request->getVar('name'),
                'email'=>$this->request->getVar('email'),
                'password'=>password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $usermodel= new UserModel();
            $usermodel->save($data);